Repository: JakMobius/EasyHTML
Catalog: EasyHTML/*.lproj/Editor.strings
Languages: ru, zh_hans

# loadingstep_downloading
source: Downloading the file... (#%)
ru: Загрузка файла... (#%)
zh_hans: 下载文件中... (#%)

# loadingstep_booting
source: Booting up the editor...
ru: Запуск редактора...
zh_hans: 启动编辑器中...

# loadingstep_processingfile
source: Processing the file... (#%)
ru: Обработка файла... (#%)
zh_hans: 处理文件中... (#%)

# loadingstep_loadingfile
source: Loading the file...
ru: Открытие файла...
zh_hans: 加载文件中...

# downloaderror
source: An error occured while downloading the file. Please, check your internet connection and try again
ru: Во время загрузки файла произошла ошибка. Проверьте соединение с сетью и повторите попытку
zh_hans: 下载文件时出错。请检查您的网络连接，然后再试一次

# lowdiskspace
source: Your device has only # of available storage space. To prevent information loss, you need to free up storage space
ru: На устройстве осталось мало доступного свободного места (#). Рекомендуем освободить память устойства в целях избежания потери информации
zh_hans: 您的设备只有 # 可用存储空间。为防止信息丢失，需要释放存储空间

source: Search
ru: Поиск
zh_hans: 搜索

source: Replace
ru: Замена
zh_hans: 替换

source: Copy
ru: Копировать
zh_hans: 复制

source: Paste
ru: Вставить
zh_hans: 黏贴

source: Cut
ru: Вырезать
zh_hans: 剪切

source: Select
ru: Выбрать
zh_hans: 选择

source: Select all
ru: Выбрать всё
zh_hans: 全选

source: Replace with
ru: Заменить на
zh_hans: 替换为

source: Undo
ru: Отменить
zh_hans: 撤销

source: Redo
ru: Вернуть
zh_hans: 重做

# commentOut
source: Comment selection
ru: Комментировать
zh_hans: 注解选择

source: Searching error
ru: Ошибка поиска
zh_hans: 搜索错误

# save
source: Save file
ru: Сохранить файл
zh_hans: 保存文件

source: Insert line after
ru: Вставить строку сверху
zh_hans: 插入行后

source: Insert line before
ru: Вставить строку снизу
zh_hans: 插入行前

source: Select line
ru: Выбрать строку
zh_hans: 选择行

source: Duplicate line
ru: Дублировать строку
zh_hans: 复制行

source: Jump to bracket
ru: Перейти к скобке
zh_hans: 跳转到括号

source: Expand abbreviation
ru: Раскрыть аббревиатуру
zh_hans: 展开缩写

source: Balance outward
ru: Выделить внешний тэг
zh_hans: 分离外部标签

source: Balance inward
ru: Выделить внутренний тэг
zh_hans: 分离内部标签

source: Wrap with abbreviation
ru: Выделить аббревиатурой
zh_hans: 包裹缩写

source: Select scope
ru: Выделить область видимости
zh_hans: 选择范围

source: Enter abbreviation
ru: Введите аббревиатуру
zh_hans: 输入缩写

source: Toggle fullscreen
ru: Полноэкранный режим
zh_hans: 切换全屏

source: Reflect CSS Value
ru: Обновить значения CSS
zh_hans: 重构CSS值

source: Select next item
ru: Следующий обьект
zh_hans: 选择下一个项

# selectPrevItem
source: Select previous item
ru: Предыдущий обьект
zh_hans: 选择上一个项

source: Next edit point
ru: Следующая точка редактирования
zh_hans: 跳转到下一个编辑点

# prevEditPoint
source: Previous edit point
ru: Предыдущая точка редактирования
zh_hans: 跳转到上一个编辑点

# solveMathExpression
source: Solve math expession
ru: Решить математическое выражение
zh_hans: 处理数学表达式

# editorerror
source: An error occured while opening this file in the editor. Would you like to send an error report to help developer fix this error faster? The following information will be sent: - Device model name and iOS version; - EasyHTML version - Error information; - Editor configuration The report information will be sent in encrypted form.
ru: Во время загрузки этого файла произошла ошибка редактора. Хотите ли вы отправить отчет об ошибке чтобы помочь разработчику исправить эту ошибку быстрее? Следующая информация будет отправлена: - Модель устройства и версия iOS; - Версия EasyHTML; - Информация об ошибке; - Конфигурация редактора Ваши данные будут отправлены в зашифрованном виде.
zh_hans: 在编辑器中打开此文件时出现错误。 您是否希望发送错误报告以帮助开发人员更快地修复此错误? 会发送以下信息: - 设备型号名称和iOS版本号; - EasyHTML版本 - 错误信息; - 编辑器配置 报告信息将以加密的形式发送。

# encodingerror
source: Failed to open this file using encoding "{1}". Falling back to "{2}"
ru: Не удалось открыть этот файл с помощью кодировки "{1}". Используется резервная кодировка "{2}"
zh_hans: 无法使用编码 "{1}" 打开此文件。 返回到 "{2}"

# readonly
source: File is read-only
ru: Файл только для чтения
zh_hans: 文件为只读文件

# filemoved
source: The file has been moved or renamed. The editor will save it to a new location.
ru: Редактируемый файл был перемещен. Редактор сохранит его в новое расположение.
zh_hans: 文件已被移动或重命名。编辑器将把它保存到一个新的位置。

# ue_desc
source: Please specify exactly how to open this type of file (#0)
ru: Пожалуйста, укажите, как именно следует открыть файл этого типа (#0)
zh_hans: 请详细说明如何打开这种类型的文件 (#0)

source: No editor
ru: Редактор пуст
zh_hans: 无编辑器

# noeditorhint
source: Select the file to edit in the list on the left
ru: Выберите файл для редактирования в списке слева
zh_hans: 在左侧的列表中选择要编辑的文件

# replacesingle
source: Replace
ru: Заменить
zh_hans: 替换

# replaceall
source: All
ru: Всё
zh_hans: 全部

# replacednumber
source: Replaced # occurences
ru: Заменено совпадений: #
zh_hans: 替代 # 出现

# occurencesfound
source: Matches: #
ru: Совпадений: #
zh_hans: 匹配: #

source: Searching...
ru: Идёт поиск...
zh_hans: 搜索中...

source: Replacing...
ru: Идёт замена...
zh_hans: 替换中...

# nooccurrencesfound
source: Not found
ru: Совпадений не найдено
zh_hans: 未能找到
