Repository: JakMobius/EasyHTML
Catalog: EasyHTML/*.lproj/Files.strings
Languages: ru, zh_hans

# errormalformedpath
source: Malformed file path
ru: Неверный адрес файла
zh_hans: 异常的文件路径

# errornotfile
source: Expected file, but the given path refers to something that isn't a file
ru: Ожидался файл, но данный адрес относится к тому, что не является файлом
zh_hans: 预期是文件，但给定的路径指的不是文件

# errornotfolder
source: Expected folder, but the given path refers to something that isn't a folder
ru: Ожидалась папка, но данный адрес относится к тому, что не является папкой
zh_hans: 预期是文件夹，但给定的路径指的不是文件夹

# errornotfound
source: There is nothing at the given path
ru: По указанному адресу ничего не найдено
zh_hans: 在给定的路径上什么都没有

# errorrestrictedcontent
source: The file cannot be transferred because the content is restricted
ru: Файл не может быть передан, поскольку его содержимое заблокировано
zh_hans: 由于内容受到限制，无法传输文件

source: Internal server error
ru: Внутренняя ошибка сервера
zh_hans: 内部服务器错误

source: Bad input error
ru: Некорректный запрос
zh_hans: 错误输入错误

# autherror
source: Authentication error
ru: Ошибка аутентификации
zh_hans: 授权错误

source: Access error
ru: Ошибка доступа
zh_hans: 访问错误

source: Rate limit error
ru: Превышена допустимая частота запросов
zh_hans: 速率限制错误

source: HTTP Error
ru: Ошибка HTTP
zh_hans: HTTP错误

# errorfileonpath
source: There is a file on the way
ru: Адрес назначения содержит файл
zh_hans: 有文件在此位置

# errorfolderonpath
source: There is a folder on the way
ru: Адрес назначения содержит папку
zh_hans: 有文件夹在此位置

# errordisallowedname
source: Disallowed name
ru: Недопустимое имя
zh_hans: 无效的名称

# errorinsufficientspace
source: Insufficient space
ru: Недостаточно места
zh_hans: 空间不足

# errornowritepermission
source: You have not write permission
ru: У Вас нет права на запись
zh_hans: 您没有写入的权限

# errorteamfolder
source: Cannot move or delete team folders.
ru: Невозможно переместить или удалить командные папки
zh_hans: 无法移动或删除团队文件夹。

# errortoomanywriteoperations
source: Too many write operations. Please, try again later
ru: Слишком много запросов на запись. Попробуйте позже
zh_hans: 写入操作太多。请稍后再试

# errortoomanyfiles
source: Too many files to delete (>10000)
ru: Слишком много файлов для удаления (>10000)
zh_hans: 需要删除的文件太多(>10000)

# errorpreviewinprogress
source: This preview generation is still in progress
ru: Предпросмотр еще создается
zh_hans: 此预览生成仍在进行中

# errorpreviewunsupportedcontent
source: Unsupported content
ru: Неподдерживаемое содержимое
zh_hans: 不支持的内容

# errorpreviewunsupportedextension
source: Unsupported extension
ru: Неподдерживаемое расширение
zh_hans: 不支持的扩展

# errorrestoreinvalidrevision
source: The revision is invalid
zh_hans: 修订无效

# errorthumbnailunsupportedextension
source: Unsupported extension
ru: Неподдерживаемое расширение
zh_hans: 不支持的扩展

# errorthumbnailunsupportedimage
source: Unsupported image
ru: Неподдерживаемое изображение
zh_hans: 不支持的图片

# errorrelocationfromlookup
source: Failed to lookup source path:
ru: Ошибка адреса источника
zh_hans: 查找源路径失败:

# errorrelocationfromwrite
source: Failed to write to source path:
ru: Ошибка записи в адрес источника
zh_hans: 写入源路径失败:

# errorrelocationtowrite
source: Failed to write to destination path:
ru: Ошибка записи в адрес назначения
zh_hans: 写入目标路径失败:

# errorcantcopysharedfolder
source: Cannot copy shared folder
ru: Невозможно скопировать общую папку
zh_hans: 无法复制共享文件夹

# errorcantnestsharedfolder
source: Your move operation would result in nested shared folders. This is not allowed.
ru: Операция перемещения приведет к вложенным общим папкам, что запрещено
zh_hans: 您的移动操作将导致嵌套的共享文件夹。这是不允许的。

# errorrelocationtoomanyfiles
source: Too many files to copy (>10000)
ru: Слишком много файлов для копирования (>10000)
zh_hans: 需要复制的文件太多 (>10000)

# errorduplicatedornestedpaths
source: There are duplicated/nested paths among source and destination paths
zh_hans: 源路径和目标路径之间存在重复/嵌套路径

# errorcantmovefolderintoitself
source: Cannot move folder to itself
ru: Невозможно переместить папку в саму себя
zh_hans: 无法将文件夹移动到自身

# errorthumbnailconversion
source: An error occurs during thumbnail conversion
ru: Произошла ошибка при создании предпросмотра
zh_hans: 缩略图转换过程中发生错误

# remotefileopeningioswarning
source: Remote HTML preview is only available in iOS 11.0 and newer
ru: Предпросмотр HTML файлов, расположенных удалённо, доступен только c iOS 11
zh_hans: 远程HTML预览仅在iOS 11.0及更新版本中可用

source: Empty folder
ru: Пустая папка
zh_hans: 空的文件夹

# emptyfolderhint
source: Tap the '+' sign in the corner of the list to add a new file, create folder or import media
ru: Коснитесь значка '+' в углу списка, чтобы добавить новый файл, создать папку или импортировать медиафайлы
zh_hans: 点击列表角落的“+”号，可以添加新文件、创建文件夹或导入媒体

# cloning
source: Duplicating...
ru: Дублирование...
zh_hans: 复制中...

source: Renaming...
ru: Переименование...
zh_hans: 重命名中...

# foldererror
source: Read error
ru: Ошибка чтения
zh_hans: 读取错误

# foldererrordesc
source: An error occured while trying to read the contents of the folder
ru: Во время чтения папки произошла ошибка
zh_hans: 试图读取文件夹内容时出错

source: Uploading library...
ru: Отправка библиотеки
zh_hans: 上传库中...

# dropboxziplibrarywarn
source: Archived library
ru: Сжатая библиотека
zh_hans: 被压缩的库

# dropboxziplibrarywarndesc
source: # is a compressed archive. EasyHTML cannot unzip remote files. Are you sure want to upload this library?
ru: Библиотека '#' является сжатым архивом. Средства EasyHTML не позволяют разархивировать файлы на удаленных размещениях. Вы действительно хотите загрузить эту библиотеку?
zh_hans: # 是一个压缩的归档文件。EasyHTML无法解压缩远程文件。您确定要上传这个库吗?

source: Uploading photo...
ru: Отправка изображения
zh_hans: 上传照片中...

# countingfiles
source: Preparing (# files)
ru: Подготовка (# файлов)
zh_hans: 准备中 (# 个文件)

# deletingfiles
source: Deleting files (#1 of #2)
ru: Удаление файлов (#1 из #2)
zh_hans: 删除文件中 (#2 的 #1)

# copyingfiles
source: Copying files (#1 of #2)
ru: Копирование файлов (#1 из #2)
zh_hans: 拷贝文件中 (#2 的 #1)

# cannotmovefileshere
source: Unable to move any files here
ru: Невозможно переместить файлы сюда
zh_hans: 无法在此移动任何文件

# cannotmovethisfilehere
source: Unable to move this file here
ru: Невозможно переместить этот файл сюда
zh_hans: 无法将此文件移动到此

# cannotmoveloadingisinprogress
source: Unable to move files here because folder is not loaded yet
ru: Пожалуйста, дождитесь окончания загрузки папки перед перемещением файлов
zh_hans: 无法在此移动文件，因为文件夹尚未加载

# movehint1
source: Slide the deck up to move all the files to current directory
ru: Смахните колоду вверх, чтобы переместить все файлы в текущую папку
zh_hans: 向上滑动面板，将所有文件移动到当前目录

# movehint2
source: Slide the deck right to copy files selectively
ru: Смахните колоду вправо, чтобы перемещать файлы выборочно
zh_hans: 向右滑动面板可以选择性地复制文件

# movehint3
source: Slide the deck left to cancel
ru: Сдвиньте колоду влево для отмены
zh_hans: 将面板向左滑动以取消

# movehinthorizontal1
source: Slide the card up to move the file to current directory
ru: Смахните карточку вверх, чтобы скопировать файл в текущую папку
zh_hans: 向上滑动面板以将文件移动到当前目录

# movehinthorizontal2
source: Slide down to return to grouped layout
ru: Сдвиньте список вниз, чтобы вернуться к группированному виду
zh_hans: 向下滑动可返回到分组布局

# movehinthorizontal3
source: Hold to remove files from list
ru: Удерживайте, чтобы удалить файлы из списка
zh_hans: 按住可从列表中删除文件

# dndnotlocalfile
source: You should download this file first
ru: Сначала скачайте файл с удалённого размещения
zh_hans: 你应该先下载这个文件
