Repository: JakMobius/EasyHTML
Catalog: EasyHTML/*.lproj/Preferences.strings
Languages: ru, zh_hans

source: Statistics
ru: Статистика
zh_hans: 统计信息

# stat_filescreated
source: Total files created
ru: Всего создано файлов
zh_hans: 总共创建的文件

# stat_filesdeleted
source: Total files deleted
ru: Всего удалено файлов
zh_hans: 总共删除的文件

# stat_filesopened
source: Total files opened
ru: Всего открыто файлов
zh_hans: 总共打开的文件

# stat_folderscreated
source: Total folders created
ru: Всего создано папок
zh_hans: 总共创建的文件夹

# stat_foldersdeleted
source: Total folders deleted
ru: Всего удалено папок
zh_hans: 总共删除的文件夹

# stat_installdate
source: Application install date
ru: Дата установки приложения
zh_hans: 引用安装日期

# stat_installversion
source: First installed version
ru: Первая установленная версия
zh_hans: 第一个安装的版本

# stat_symbolswritten
source: Total symbols written
ru: Всего символов введено
zh_hans: 总共写的符号

# stat_earlyversion
source: 1.3.1 or earlier
ru: 1.3.1 или более ранняя
zh_hans: 1.3.1 或更早

# codehighlightingpref
source: Syntax highlighting
ru: Подсветка синтаксиса
zh_hans: 语法高亮

# codehighlightingitem
source: Syntax highlighting options
ru: Настройки подсветки синтаксиса
zh_hans: 语法高亮选项

# codehighlightingconf
source: Configuration
ru: Конфигурация
zh_hans: 配置

# selecthighlightingmode
source: Select mode
ru: Выбор режима
zh_hans: 选择模式

# newsyntaxhighlightingscheme
source: New scheme
ru: Новый режим
zh_hans: 新配置

source: File extension
ru: Расширение файла
zh_hans: 文件拓展名

# createsyntaxhighlightingscheme
source: Create
ru: Создать
zh_hans: 创建

source: CONSOLE OPTIONS
ru: ОПЦИИ КОНСОЛИ
zh_hans: 控制台选项

# consoleshouldvanish
source: Clear console automatically
ru: Авто-очистка консоли
zh_hans: 自动清除控制台

# searchsettings
source: SEARCH / REPLACE OPTIONS
ru: НАСТРОЙКИ ПОИСКА / ЗАМЕНЫ
zh_hans: 搜索 / 替换 选项

# casesensitivesearch
source: Case-sensitive searching
ru: Регистрозависимый поиск
zh_hans: 区分大小写的搜索

source: Language
ru: Язык
zh_hans: 语言

# langneedtoreboot
source: Сhanges will take effect after restarting the application
ru: Изменения вступят в силу после перезагрузки приложения
zh_hans: 更改将在重新启动应用程序后生效

source: By editing date
ru: По дате редактирования
zh_hans: 根据修改日期

source: By creation date
ru: По дате создания
zh_hans: 根据创建日期

source: By name
ru: По имени
zh_hans: 根据名称

source: By type
ru: По типу
zh_hans: 根据类型

# nosorting
source: None
ru: Нет
zh_hans: 无

# byeditingdatedesc
source: After editing, the file will be moved to the top of the list. This file sorting type does not support remote locations.
ru: После редактирования, файл будет перемещен в самый верх списка. Этот тип сортировки не поддерживает сетевые расположения
zh_hans: 编辑后，该文件将被移动到列表的顶部。此文件排序类型不支持远程位置。

# bycreationdatedesc
source: At the very top will be files and folders created later than others. This file sorting type does not support remote locations.
ru: В самом верху будут находиться файлы и папки, созданные позже остальных. Этот тип сортировки не поддерживает сетевые расположения
zh_hans: 越晚创建的文件或文件夹将会在越上面。此文件排序类型不支持远程位置。

# bynamedesc
source: Files and folders will be sorted based on their name.
ru: Файлы и папки будут отсортированы исходя из их названия.
zh_hans: 文件和文件夹将根据它们的名称排序。

# bytypedesc
source: Files sorted by type will be located at the top, folders - at the bottom.
ru: Файлы, отсортированные по типу, будут находиться вверху, папки - внизу.
zh_hans: 按类型排序的文件将位于顶部，文件夹在底部。

# nosortingdesc
source: The file list will not be sorted
ru: Список файлов не будет подвергаться сортировке
zh_hans: 文件列表将不会排序

source: Files
ru: Файлы
zh_hans: 文件

# sortingtype
source: FILE SORTING TYPE
ru: ТИП СОРТИРОВКИ ФАЙЛОВ
zh_hans: 文件排序类型

source: Feedback
ru: Обратная связь
zh_hans: 反馈

# vkpage
source: Developer's VK Page
ru: Страница разработчика в VK
zh_hans: 开发者的VK页面

# bugmail
source: Developer's E-Mail
ru: Почтовый адрес разработчика
zh_hans: 开发者的电子邮件

source: Layout
ru: Внешний вид
zh_hans: 布局

# theme0
source: Green
ru: Зеленая
zh_hans: 绿色

# theme1
source: Red
ru: Красная
zh_hans: 红色

# theme2
source: Dark
ru: Темная
zh_hans: 黑色

# theme3
source: Blue
ru: Синяя
zh_hans: 男生

# usageofblacktheme
source: Use a dark theme if you want to save the battery charge on an OLED display device
ru: Используйте темную тему, если желаете сэкономить заряд батареи на устройстве с OLED-дисплеем
zh_hans: 如果您想节省OLED显示设备的电量，请使用黑色

# themesectiontitle
source: COLOR THEME
ru: ЦВЕТОВАЯ ТЕМА
zh_hans: 颜色主题

# autoCloseBrackets
source: Automatically close brackets and quotes
ru: Автоматически закрывать скобки и кавычки
zh_hans: 自动关闭括号和引号

source: Line numbers
ru: Номера строк
zh_hans: 行号

# matchTags
source: Highlight matching XML Tags
ru: Выделять родственные XML-Тэги
zh_hans: 高亮XML标签

# matchBrackets
source: Highlight matching brackets
ru: Выделять родственные скобки
zh_hans: 高亮匹配的括号

# autoCloseTags
source: Automatically close XML tags
ru: Автоматически закрывать XML-тэги
zh_hans: 自动关闭XML标签

# foldGutter
source: Enable code folding
ru: Включить свертывание кода
zh_hans: 启用代码折叠

# colorpicker
source: Color Labels
ru: Цветовые метки
zh_hans: 颜色标签

source: Line Wrapping
ru: Перенос слов
zh_hans: 自动换行

source: EDITOR OPTIONS
ru: ОПЦИИ РЕДАКТОРА
zh_hans: 编辑器选项

source: FONT SIZE
ru: РАЗМЕР ШРИФТА
zh_hans: 字体大小

# pluginsdescription
source: Some functions of the editor can be turned off in order to save battery, or in cases where your device loads files too slow or does not work enough smoothly
ru: Некоторые функции редактора можно отключить в целях экономии заряда батареи, либо в случаях, если Ваше устройство загружает файлы слишком долго или работает недостаточно плавно
zh_hans: 需要节省电量或出现卡顿的情况下，可以关闭编辑器的一些功能

# fontsizedescription
source: The font size can also be changed while editing the file using the buttons in the additional panel
ru: Размер шрифта также можно изменить во время редактирования файла при помощи кнопок в дополнительной панели
zh_hans: 在使用附加面板中的按钮编辑文件时，还可以更改字体大小

# sortdescription
source: File sorting is only possible in local, FTP and SFTP locations.
ru: Сортировка файлов возможна только в локальных и FTP и SFTP - расположениях.
zh_hans: 文件排序只能应用在本地，FTP和SFTP位置。

# hapticfeedbackoptions
source: HAPTIC FEEDBACK
ru: ТАКТИЛЬНЫЙ ОТКЛИК
zh_hans: 触觉反馈选项

source: Haptic feedback
ru: Тактильный отклик
zh_hans: 触觉反馈

# encoding
source: Text encoding
ru: Кодировка текста
zh_hans: 文本编码

source: Line endings
ru: Символ переноса строки
zh_hans: 行尾退出符

source: Editor
ru: Редактор
zh_hans: 编辑器

# aboutprogram
source: About EasyHTML
ru: О программе
zh_hans: 关于EasyHTML

source: Text settings
ru: Настройки отображения
zh_hans: 文本设置

# textsettingsdesc
source: If the file can not be opened using the specified text encoding, the editor will fall back to the ASCII encoding
ru: Если файл не удается открыть используя указанную кодировку, будет использована резервная кодировка ASCII
zh_hans: 如果无法使用指定的文本编码打开文件，编辑器将退回到ASCII编码

# keyboardheader
source: KEYBOARD
ru: КЛАВИАТУРА
zh_hans: 键盘

# keyboarddarkmode
source: Adjust keyboard appearance
ru: Менять цвет клавиатуры в редакторе
zh_hans: 调整键盘外观

# keyboarddarkmodewarn
source: This option may work improperly on some devices
ru: Эта опция может работать некорректно на некоторых устройствах
zh_hans: 此选项在某些设备上可能无法正常工作

# helpermenupref
source: Setup assistant menu
ru: Настроить вспомогательное меню
zh_hans: 设置菜单助手

# helpermenu
source: Assistant menu
ru: Вспомогательное меню
zh_hans: 助手菜单

# helpermenuon
source: ENROLL
ru: ВКЛЮЧИТЬ
zh_hans: 添加

# helpermenumore
source: MORE CONTROLS
ru: ЕЩЕ ЭЛЕМ. УПРАВЛЕНИЯ
zh_hans: 更多控制

# helpermenuitem0
source: Undo
ru: Отменить
zh_hans: 撤销

# helpermenuitem1
source: Redo
ru: Повторить
zh_hans: 重做

# helpermenuitem2
source: Save
ru: Сохранить
zh_hans: 保存

# helpermenuitem3
source: Open colorpicker
ru: Открыть колорпикер
zh_hans: 打开颜色选择器

# helpermenuitem4
source: Open gradient
ru: Открыть градиентпикер
zh_hans: 打开渐变

# helpermenuitem5
source: Search
ru: Поиск
zh_hans: 搜索

# helpermenuitem6
source: Replace
ru: Замена
zh_hans: 替换

# helpermenuitem7
source: Increase font size
ru: Увеличить шрифт
zh_hans: 增大字体

# helpermenuitem8
source: Decrease font size
ru: Уменьшить шрифт
zh_hans: 缩小字体

# helpermenuitem9
source: Opening parenthesis
ru: Открывающая круглая скобка
zh_hans: 开括号

# helpermenuitem10
source: Closing parenthesis
ru: Закрывающая круглая скобка
zh_hans: 闭括号

# helpermenuitem11
source: Opening curly bracket
ru: Открывающая фигурная скобка
zh_hans: 打开花括号

# helpermenuitem12
source: Closing curly bracket
ru: Закрывающая фигурная скобка
zh_hans: 关闭花括号

# helpermenuitem13
source: Opening square bracket
ru: Открывающая квадратная скобка
zh_hans: 打开方括号

# helpermenuitem14
source: Closing square bracket
ru: Закрывающая квадратная скобка
zh_hans: 关闭方括号

# helpermenuitem15
source: Sign "Greater than"
ru: Знак "больше"
zh_hans: 符号 "大于"

# helpermenuitem16
source: Sign "Less than"
ru: Знак "меньше"
zh_hans: 符号 "小于"

# helpermenuitem17
source: Double quote
ru: Двойная кавычка
zh_hans: 双引号

# helpermenuitem18
source: Cursor left
ru: Курсор влево
zh_hans: 光标左移

# helpermenuitem19
source: Cursor right
ru: Курсор вправо
zh_hans: 光标右移

# helpermenuitem20
source: Tab imitation
ru: Имитация клавиши Tab
zh_hans: Tab键模拟

# helpermenuitem21
source: Auto-indent
ru: Установить отступ
zh_hans: 自动缩进

# helpermenuitem22
source: Single quote
ru: Одинарная кавычка
zh_hans: 单引号

# helpermenuitem23
source: Jump to file start
ru: В начало файла
zh_hans: 跳转到文件启动

# helpermenuitem24
source: Jump to file end
ru: В конец файла
zh_hans: 跳转到文件结束

# helpermenuitem25
source: Comment line/selection
ru: Комментировать строку
zh_hans: 注释行/选择

# helpermenuitemdelimiter
source: Delimiter
ru: Разделитель
zh_hans: 分隔符
